#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.infrastructure.module.kubernetes_cluster_infrastructure.digitalocean_loadbalancer.foreign_language_reader will be updated in-place
  ~ resource "digitalocean_loadbalancer" "foreign_language_reader" {
        algorithm              = "round_robin"
        droplet_ids            = []
        enable_proxy_protocol  = false
        id                     = "92f80e6c-bc55-4e08-88ab-a4cefa23346e"
        ip                     = "167.99.25.47"
      ~ name                   = "adfa0fdc0872441b18eff7df2ab9a1c7" -> "foreign-language-reader"
        redirect_http_to_https = false
        region                 = "sfo2"
        status                 = "active"
        urn                    = "do:loadbalancer:92f80e6c-bc55-4e08-88ab-a4cefa23346e"

        forwarding_rule {
            entry_port      = 80
            entry_protocol  = "tcp"
            target_port     = 32524
            target_protocol = "tcp"
            tls_passthrough = false
        }
        forwarding_rule {
            entry_port      = 443
            entry_protocol  = "tcp"
            target_port     = 32723
            target_protocol = "tcp"
            tls_passthrough = false
        }

        healthcheck {
            check_interval_seconds   = 3
            healthy_threshold        = 5
            port                     = 32524
            protocol                 = "tcp"
            response_timeout_seconds = 5
            unhealthy_threshold      = 3
        }

        sticky_sessions {
            cookie_ttl_seconds = 0
            type               = "none"
        }
    }

  # module.infrastructure.module.kubernetes_config.helm_release.elasticsearch will be created
  + resource "helm_release" "elasticsearch" {
      + atomic                = false
      + chart                 = "elasticsearch"
      + cleanup_on_fail       = false
      + dependency_update     = false
      + disable_crd_hooks     = false
      + disable_webhooks      = false
      + force_update          = false
      + id                    = (known after apply)
      + max_history           = 0
      + metadata              = (known after apply)
      + name                  = "elasticsearch"
      + namespace             = "logging"
      + recreate_pods         = false
      + render_subchart_notes = true
      + replace               = false
      + repository            = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values          = false
      + reuse_values          = false
      + skip_crds             = false
      + status                = "deployed"
      + timeout               = 300
      + verify                = false
      + version               = "1.32.4"
      + wait                  = true
    }

  # module.infrastructure.module.kubernetes_config.helm_release.kibana will be created
  + resource "helm_release" "kibana" {
      + atomic                = false
      + chart                 = "kibana"
      + cleanup_on_fail       = false
      + dependency_update     = false
      + disable_crd_hooks     = false
      + disable_webhooks      = false
      + force_update          = false
      + id                    = (known after apply)
      + max_history           = 0
      + metadata              = (known after apply)
      + name                  = "kibana"
      + namespace             = "logging"
      + recreate_pods         = false
      + render_subchart_notes = true
      + replace               = false
      + repository            = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values          = false
      + reuse_values          = false
      + skip_crds             = false
      + status                = "deployed"
      + timeout               = 300
      + verify                = false
      + version               = "3.2.6"
      + wait                  = true
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_namespace.logging will be created
  + resource "kubernetes_namespace" "logging" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "logging"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
